bench/results/20260505T013550Z/polystac-pgstac/k6.log

     ✗ ok
      ↳  99% — ✓ 71463 / ✗ 4

     checks.........................: 99.99% ✓ 71463       ✗ 4    
     data_received..................: 328 MB 11 MB/s
     data_sent......................: 8.2 MB 274 kB/s
     http_req_blocked...............: min=378ns    med=1.75µs  p(90)=2.95µs   p(95)=3.51µs   p(99)=6.6µs    max=1.63ms  
     http_req_connecting............: min=0s       med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=485.63µs
     http_req_duration..............: min=123.41µs med=9.05ms  p(90)=15.39ms  p(95)=16.85ms  p(99)=19.69ms  max=114.31ms
       { expected_response:true }...: min=123.41µs med=9.05ms  p(90)=15.39ms  p(95)=16.85ms  p(99)=19.68ms  max=109.21ms
   ✓ http_req_failed................: 0.00%  ✓ 4           ✗ 71463
     http_req_receiving.............: min=5.38µs   med=43.33µs p(90)=115.31µs p(95)=253.15µs p(99)=958.55µs max=7.31ms  
     http_req_sending...............: min=1.66µs   med=8.16µs  p(90)=15.74µs  p(95)=33.08µs  p(99)=148.14µs max=6.21ms  
     http_req_tls_handshaking.......: min=0s       med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...............: min=97.53µs  med=8.94ms  p(90)=15.27ms  p(95)=16.72ms  p(99)=19.54ms  max=114.13ms
     http_reqs......................: 71467  2381.443357/s
     iteration_duration.............: min=187µs    med=9.18ms  p(90)=15.55ms  p(95)=17ms     p(99)=19.84ms  max=114.73ms
     iterations.....................: 71467  2381.443357/s
     latency_collections_ms.........: min=0s       med=1ms     p(90)=3ms      p(95)=4ms      p(99)=6ms      max=82ms    
     latency_landing_ms.............: min=0s       med=1ms     p(90)=2ms      p(95)=3ms      p(99)=5ms      max=72ms    
     latency_search_all_ms..........: min=6ms      med=12ms    p(90)=17ms     p(95)=18ms     p(99)=21ms     max=108ms   
     latency_search_bbox_ms.........: min=4ms      med=9ms     p(90)=13ms     p(95)=14ms     p(99)=17ms     max=110ms   
     latency_search_cql2_ms.........: min=6ms      med=13ms    p(90)=17ms     p(95)=19ms     p(99)=21ms     max=108ms   
     latency_search_dt_ms...........: min=6ms      med=12ms    p(90)=17ms     p(95)=18ms     p(99)=21ms     max=115ms   
     requests_collections...........: 11863  395.302203/s
     requests_landing...............: 11925  397.368184/s
     requests_search_all............: 11830  394.202568/s
     requests_search_bbox...........: 11963  398.634431/s
     requests_search_cql2...........: 11946  398.067952/s
     requests_search_dt.............: 11940  397.868019/s
     vus............................: 20     min=20        max=20 
     vus_max........................: 20     min=20        max=20